{"keras_version": "2.2.4", "config": {"layers": [{"config": {"input_dim": 2000, "embeddings_constraint": null, "mask_zero": false, "input_length": 28, "output_dim": 128, "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 28], "dtype": "float32", "name": "embedding_1", "embeddings_regularizer": null, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "rate": 0.4, "name": "spatial_dropout1d_1", "seed": null, "noise_shape": null}, "class_name": "SpatialDropout1D"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "return_sequences": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "implementation": 1, "recurrent_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 196, "recurrent_regularizer": null, "unroll": false, "return_state": false, "go_backwards": false, "kernel_constraint": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 2, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}