{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "name": "conv2d_2", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "name": "conv2d_3", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "name": "conv2d_4", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "name": "conv2d_5", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "name": "conv2d_6", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_4", "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_5", "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_6", "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10}}], "name": "sequential_1"}}